afrab/WSim/arch/msp430/msp430_adc12.c
/**
 *  \file   msp430_adc12.c
 *  \brief  MSP430 Adc12 controller
 *  \author Antoine Fraboulet
 *  \date   2006
 **/

#include <stdlib.h>
#include "arch/common/hardware.h"
#include "msp430.h"
#include "src/options.h"

#if defined(__msp430_have_adc12)

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define ADC12_VERBOSE_LEVEL 4
#define ADC12_DEBUG_LEVEL_2 

#define HW_DMSG_ADC12(x...) VERBOSE(ADC12_VERBOSE_LEVEL,x)

#if defined(ADC12_DEBUG_LEVEL_2)
#define HW_DMSG_2_DBG(x...) VERBOSE(ADC12_VERBOSE_LEVEL,x)
#else
#define HW_DMSG_2_DBG(x...) do { } while (0)
#endif


/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

tracer_id_t MSP430_TRACER_ADC12STATE;
tracer_id_t MSP430_TRACER_ADC12INPUT[ADC12_CHANNELS];

#define ADC12_TRACER_STATE(v)   tracer_event_record(MSP430_TRACER_ADC12STATE, v)
#define ADC12_TRACER_INPUT(i,v) tracer_event_record(MSP430_TRACER_ADC12INPUT[i], v)

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define ADC12_NONE      0
#define ADC12_CHANN_PTR 1
#define ADC12_RND       2
#define ADC12_WSNET     3

int         msp430_adc12_channels_valid[ADC12_CHANNELS];
char        msp430_adc12_channels_name[ADC12_CHANNELS][MAX_FILENAME];
uint16_t*   msp430_adc12_channels_data[ADC12_CHANNELS];
uint32_t    msp430_adc12_channels_data_max[ADC12_CHANNELS];

#define ADC12_CHANNEL_NAMES 20
char trace_names[ADC12_CHANNELS][ADC12_CHANNEL_NAMES] = {
  "adc12_input_00", "adc12_input_01", "adc12_input_02", "adc12_input_03",
  "adc12_input_04", "adc12_input_05", "adc12_input_06", "adc12_input_07",
  "adc12_input_08", "adc12_input_09", "adc12_input_10", "adc12_input_11",
  "adc12_input_12", "adc12_input_13", "adc12_input_14", "adc12_input_15"
};

#define ADC12_MODES        4
#define ADC12_MODES_NAMES 40
char adc12_modes[ADC12_MODES][ADC12_MODES_NAMES] = {
  "Single Channel Single Conversion",  "Sequence of Channels",
  "Repeat Single Channel",  "Repeat Sequence of Channels"
};

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

/* ADC12 internal OSC is ~ 5MHz */
/* cycle_nanotime == 200        */
#define NANO                    (  1000*1000*1000)
#define ADC12OSC_FREQ           (     5*1000*1000)

#define ADC12OSC_CYCLE_NANOTIME (NANO / ADC12OSC_FREQ) 


/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

static struct moption_t adc12_in_opt = {
  .longname    = "msp430_adc12",
  .type        = required_argument,
  .helpstring  = "msp430 adc12 input",
  .value       = NULL
};

int msp430_adc12_option_add (void)
{
  options_add( &adc12_in_opt );
  return 0;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

int msp430_adc12_find_inputs()
{
  char delim1[] = ",";
  char delim2[] = ":";
  char *str1,*str2;
  char *token,*subtoken;
  char *saveptr1,*saveptr2;
  char *filename;
  char name[MAX_FILENAME];
  int  j;
  int id;
  strncpy(name, adc12_in_opt.value, MAX_FILENAME);

  /* --msp430_adc12=1:file,2:file,3:file ... */

  for (j = 1, str1 = name; ; j++, str1 = NULL) 
    {
      token = strtok_r(str1, delim1, &saveptr1);
      if (token == NULL)
	break;
      HW_DMSG_ADC12("msp430:adc12:%d: %s\n", j, token);
    
      str2 = token;
      subtoken = strtok_r(str2, delim2, &saveptr2);
      if (subtoken == NULL) 
	{ 
	  ERROR("msp430:adc12: wrong channel id \n");
	  return 1;	
	}
      id = atoi(subtoken);
      if ((id < 0) || (id >= ADC12_CHANNELS))
	{
	  ERROR("msp430:adc12: wrong channel id %s (%d)\n",subtoken,id);
	  return 1;
	}

      subtoken = strtok_r(NULL, delim2, &saveptr2);
      filename = subtoken;
      if (subtoken == NULL) 
	{
	  ERROR("msp430:adc12: wrong channel filename\n");
	  return 1;	
	}

      subtoken = strtok_r(NULL, delim2, &saveptr2);
      if (subtoken != NULL) 
	{
	  ERROR("msp430:adc12: wrong channel filename trailer %s\n",subtoken);
	  return 1;	
	}

      HW_DMSG_ADC12("msp430:adc12: channel %02d = %s\n",id, filename);
      msp430_adc12_channels_valid[id]    = ADC12_CHANN_PTR;
      strncpy(msp430_adc12_channels_name[id], filename, MAX_FILENAME);
    }
  return 0;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

int msp430_adc12_read_inputs()
{
  int chan;
  uint32_t smpl;
  for(chan=0; chan < ADC12_CHANNELS; chan++)
    {
      if (msp430_adc12_channels_valid[ chan ] == ADC12_CHANN_PTR)
	{
	  FILE* f;
	  int   val;

	  /* size */
	  f = fopen(msp430_adc12_channels_name[ chan ],"rb");
	  if (f==NULL)
	    {
	      ERROR("msp430:adc12: cannot open file %s\n",msp430_adc12_channels_name[ chan ]);
	      return 1;
	    }
	  while(fscanf(f,"%d",&val) > 0)
	    {
	      msp430_adc12_channels_data_max[ chan ] ++;
	    }
	  msp430_adc12_channels_data[ chan ] = malloc(msp430_adc12_channels_data_max[ chan ]*sizeof(uint16_t));
	  if (msp430_adc12_channels_data[ chan ] == NULL)
	    {
	      ERROR("msp430:adc12: cannot allocate memory for input %s\n",msp430_adc12_channels_name[ chan ]);
	      fclose(f);
	      return 1;
	    }

	  /* read */
	  fseek(f,0,SEEK_SET);
	  for(smpl=0; smpl<msp430_adc12_channels_data_max[ chan ]; smpl++)
	    {
	      fscanf(f,"%d",&val);
	      msp430_adc12_channels_data[ chan ][ smpl ] = val & 0xfff; /* 12 bits */
	    }

	  fclose(f);
	  HW_DMSG_ADC12("msp430:adc12: channel %02d filled with %d samples\n",
			chan ,msp430_adc12_channels_data_max[ chan ]);
	}
    }
  return 0;
}

int msp430_adc12_delete_inputs()
{
  int i;
  for(i=0; i < ADC12_CHANNELS; i++)
    {
      if (msp430_adc12_channels_valid[i] == ADC12_CHANN_PTR)
	{
	  free(msp430_adc12_channels_data[i]);
	  msp430_adc12_channels_data[i] = NULL;
	}
    }
  return 0;
}

uint16_t msp430_adc12_sample_input(int hw_channel_x)
{
  uint16_t sample = 0;
  switch (msp430_adc12_channels_valid[hw_channel_x])
    {
    case ADC12_NONE:
      /* default mode */
      HW_DMSG_ADC12("msp430:adc12:     0xeaea sample for input channel %d\n", hw_channel_x);
      sample = 0xeaea;
      break;

    case ADC12_CHANN_PTR:
      HW_DMSG_2_DBG("msp430:adc12:     sample for input channel %d - %s\n",
		    hw_channel_x, msp430_adc12_channels_name[hw_channel_x]);

