afrab/WSim/arch/msp430/msp430_adc12.c
      sample = msp430_adc12_channels_data[ hw_channel_x ][ MCU.adc12.chann_ptr[ hw_channel_x ] ] ;

      MCU.adc12.chann_ptr[ hw_channel_x ] ++;
      if (MCU.adc12.chann_ptr[ hw_channel_x ] == msp430_adc12_channels_data_max[ hw_channel_x ])
	{
	  MCU.adc12.chann_ptr[ hw_channel_x ] = 0;
	}
      break;

    case ADC12_RND:
      HW_DMSG_ADC12("msp430:adc12:     random sample for input channel %d\n", hw_channel_x);
      sample = random();
      break;

    case ADC12_WSNET:
      break;
    }
  
  return sample & 0x0FFF; /* 12 bits */
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

int msp430_adc12_init(void)
{
  int i;

  for(i=0; i<ADC12_CHANNELS; i++)
    {
      MSP430_TRACER_ADC12INPUT[i]       = 0;
      msp430_adc12_channels_valid[i]    = ADC12_NONE;
      msp430_adc12_channels_data[i]     = NULL;
      msp430_adc12_channels_data_max[i] = 0;
      strcpy(msp430_adc12_channels_name[i], "none");

      MCU.adc12.chann_ptr[i] = 0;
      MCU.adc12.chann_time[i] = 0;
      MCU.adc12.chann_period[i] = 0;
    }

  if (adc12_in_opt.isset)
    {
      msp430_adc12_find_inputs();
      msp430_adc12_read_inputs();
    }

  MSP430_TRACER_ADC12STATE    = tracer_event_add_id(1,  "adc12_enable",   "msp430");
  for(i=0; i<ADC12_CHANNELS; i++)
    {
      if (msp430_adc12_channels_valid[i] != ADC12_NONE )
	{
	  MSP430_TRACER_ADC12INPUT[i] = tracer_event_add_id(16,  trace_names[i],   "msp430");
	}

      MCU.adc12.mem[i].s = 0;
    }

  
  return 0;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

void msp430_adc12_reset(void)
{
  int i;
  /* set initial values */
  HW_DMSG_ADC12("msp430:adc12:reset()\n");
  MCU.adc12.ctl0.s = 0;
  MCU.adc12.ctl1.s = 0;
  MCU.adc12.ifg    = 0;
  MCU.adc12.ie     = 0;
  MCU.adc12.iv     = 0;
  for(i=0; i<ADC12_CHANNELS; i++)
    {
      MCU.adc12.mctl[i].s = 0;
    }

  MCU.adc12.adc12osc_freq           = ADC12OSC_FREQ;
  MCU.adc12.adc12osc_cycle_nanotime = ADC12OSC_CYCLE_NANOTIME;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define CHECK_ENC()					\
  do {							\
    if (MCU.adc12.ctl0.b.enc == 0)			\
      {							\
	MCU.adc12.state = ADC12_STATE_WAIT_ENABLE;	\
	return;						\
      }							\
  } while(0)


static const int shtdiv[16] = 
{
  4, 8, 16, 32, 64, 96, 128, 192, 256, 384, 512, 768, 1024, 1024, 1024, 1024 
};


void msp430_adc12_update(void)
{
  if (MCU.adc12.ctl0.b.adc12on == 0)
    {
      MCU.adc12.state = ADC12_STATE_OFF;
      ADC12_TRACER_STATE(0);
      return;
    }

  MCU.adc12.adc12osc_temp     += MACHINE_TIME_GET_INCR();
  MCU.adc12.adc12osc_increment = MCU.adc12.adc12osc_temp / MCU.adc12.adc12osc_cycle_nanotime;
  MCU.adc12.adc12osc_temp      = MCU.adc12.adc12osc_temp % MCU.adc12.adc12osc_cycle_nanotime;
  MCU.adc12.adc12osc_counter  += MCU.adc12.adc12osc_increment;

  MCU.adc12.adc12clk_temp     += MCU.adc12.adc12osc_increment;
  MCU.adc12.adc12clk_increment = MCU.adc12.adc12clk_temp / (MCU.adc12.ctl1.b.adc12divx + 1);
  MCU.adc12.adc12clk_temp      = MCU.adc12.adc12clk_temp % (MCU.adc12.ctl1.b.adc12divx + 1);
  MCU.adc12.adc12clk_counter  += MCU.adc12.adc12clk_increment;

  /* FIXME:: MSC is not taken into account */
  if (MCU.adc12.ctl1.b.shp == 1)
    {
      if ((0 <= MCU.adc12.current_x) && (MCU.adc12.current_x <= 7))
	{
	  /* registers MEM0 to MEM7  */
	  MCU.adc12.sht0_temp         += MCU.adc12.adc12clk_increment;
	  MCU.adc12.sht0_increment     = MCU.adc12.sht0_temp / (shtdiv[MCU.adc12.ctl0.b.sht0x]);
	  MCU.adc12.sht0_temp          = MCU.adc12.sht0_temp % (shtdiv[MCU.adc12.ctl0.b.sht0x]);
	  MCU.adc12.sampcon            = MCU.adc12.sht0_increment;
	}
      else if ((8 <= MCU.adc12.current_x) && (MCU.adc12.current_x <= 15))
	{
	  /* registers MEM8 to MEM15 */
	  MCU.adc12.sht1_temp         += MCU.adc12.adc12clk_increment;
	  MCU.adc12.sht1_increment     = MCU.adc12.sht1_temp / (shtdiv[MCU.adc12.ctl0.b.sht1x]);
	  MCU.adc12.sht1_temp          = MCU.adc12.sht1_temp % (shtdiv[MCU.adc12.ctl0.b.sht1x]);
	  MCU.adc12.sampcon            = MCU.adc12.sht1_increment;
	}
      else
	{
	  ERROR("msp430:adc12: channel out of bounds\n");
	  machine_exit(1);
	}
    }
  else
    {
      /* FIXME::sampcon = SHI */
      // ERROR("msp430:adc12: ADC does not currently support SHP = 0 mode\n");
      MCU.adc12.sampcon = 0;
    }


  switch (MCU.adc12.state)
    {
      /***************/
      /* OFF         */
      /***************/
    case ADC12_STATE_OFF: 
      HW_DMSG_ADC12("msp430:adc12:     wait for enable\n");
      MCU.adc12.state = ADC12_STATE_WAIT_ENABLE;
      ADC12_TRACER_STATE(1);
      /* no break */

      /***************/
      /* ENABLE      */
      /***************/
    case ADC12_STATE_WAIT_ENABLE:
      if (MCU.adc12.ctl0.b.enc)
	{
	  HW_DMSG_ADC12("msp430:adc12:     wait for trigger\n");
	  MCU.adc12.state = ADC12_STATE_WAIT_TRIGGER; 
	}
      if ((MCU.adc12.ctl0.b.enc) && 
	  (MCU.adc12.ctl0.b.adc12sc == 1) &&
	  (MCU.adc12.ctl1.b.shsx == 0))
	{
	  MCU.adc12.state = ADC12_STATE_SAMPLE; 
	}
      break;
      
      /***************/
      /* TRIGGER     */
      /***************/
    case ADC12_STATE_WAIT_TRIGGER:
      CHECK_ENC();
      if (MCU.adc12.sampcon > 0)
	{
	  HW_DMSG_ADC12("msp430:adc12:     trigger ok\n");
	  MCU.adc12.state = ADC12_STATE_SAMPLE;
	  MCU.adc12.sampcon --;
	}
      else
	{
	  return;
	}
      /* no break */

      /***************/
      /* SAMPLE      */
      /***************/
    case ADC12_STATE_SAMPLE:
      CHECK_ENC();
      if (MCU.adc12.sampcon > 0)
	{
	  /* 
	   * check port configuration. 
	   *   SEL = 1  // Selector  = 0:GPIO  1:peripheral
	   *   DIR = 0  // Direction = 0:input 1:output
	   */
	  HW_DMSG_ADC12("msp430:adc12:     sampling on config %d hw_channel %d (%s) [%"PRId64"]\n",
			MCU.adc12.current_x, 
			MCU.adc12.mctl[MCU.adc12.current_x].b.inch,
			trace_names[MCU.adc12.mctl[MCU.adc12.current_x].b.inch],
			MACHINE_TIME_GET_NANO());
 
