afrab/WSim/arch/msp430/msp430_adc12.c
	  MCU.adc12.sample = msp430_adc12_sample_input(MCU.adc12.mctl[MCU.adc12.current_x].b.inch);
	  
	  ADC12_TRACER_INPUT( MCU.adc12.mctl[MCU.adc12.current_x].b.inch, MCU.adc12.sample );

	  MCU.adc12.state = ADC12_STATE_CONVERT;
	  MCU.adc12.adc12clk_reftime = MCU.adc12.adc12clk_counter;
	  MCU.adc12.sampcon --;
	  
	}
      else
	{
	  return;
	}
      break;

      /***************/
      /* CONVERT     */
      /***************/
    case ADC12_STATE_CONVERT:
      CHECK_ENC();
      if (MCU.adc12.adc12clk_counter > (MCU.adc12.adc12clk_reftime + 12))
	{
	  HW_DMSG_ADC12("msp430:adc12:     convert = 0x%04x (%d) \n",MCU.adc12.sample,MCU.adc12.sample);
	  MCU.adc12.state = ADC12_STATE_STORE;
	}
      else
	{ 
	  return;
	}
      /* no break */

#define SAMPLE MCU.adc12.sample
#define STATE  MCU.adc12.state
#define ENC    MCU.adc12.ctl0.b.enc
#define MSC    MCU.adc12.ctl0.b.msc
#define SHP    MCU.adc12.ctl1.b.shp
#define ADC12x MCU.adc12.current_x

      /***************/
      /* STORE       */
      /***************/
    case ADC12_STATE_STORE:
      CHECK_ENC();
      HW_DMSG_ADC12("msp430:adc12:     store sample in ADC12MEM%d\n", ADC12x);
      MCU.adc12.mem[ ADC12x ].s = SAMPLE;
      if ((MCU.adc12.ifg & (1 << ADC12x)) == 0)
	{
	  HW_DMSG_ADC12("msp430:adc12: set interrupt for channel %d\n", ADC12x);
	}
      MCU.adc12.ifg |= 1 << ADC12x;
      msp430_adc12_chkifg();
      switch (MCU.adc12.ctl1.b.conseqx)
	{
	case ADC12_MODE_SINGLE:
	  ENC   = 0;
	  STATE = ADC12_STATE_WAIT_ENABLE;
	  HW_DMSG_ADC12("msp430:adc12: mode single, go to wait_enable\n");
	  break;

	case ADC12_MODE_SEQ_CHAN:
	  if (MCU.adc12.mctl[ ADC12x ].b.eos == 1)
	    {
	      ENC   = 0;
	      STATE = ADC12_STATE_WAIT_ENABLE;
	      HW_DMSG_ADC12("msp430:adc12: mode sequence, go to wait_enable\n");
	    }
	  else
	    {
	      ADC12x = (ADC12x + 1) % ADC12_CHANNELS;
	      if (MSC && SHP)
		{
		  STATE = ADC12_STATE_SAMPLE;
		  HW_DMSG_ADC12("msp430:adc12: mode sequence, go to sample\n");
		}
	      else
		{
		  STATE = ADC12_STATE_WAIT_TRIGGER;
		  HW_DMSG_ADC12("msp430:adc12: mode sequence, go to wait_trigger\n");
		}
	    }
	  break;

	case ADC12_MODE_REPEAT_SINGLE:
	  if (ENC == 0)
	    {
	      STATE = ADC12_STATE_WAIT_ENABLE;
	      HW_DMSG_ADC12("msp430:adc12: mode repeat, go to wait_enable\n");
	    }
	  else
	    {
	      if (MSC && SHP)
		{
		  STATE = ADC12_STATE_SAMPLE;
		  HW_DMSG_ADC12("msp430:adc12: mode repeat, go to sample\n");
		}
	      else
		{
		  STATE = ADC12_STATE_WAIT_TRIGGER;
		  HW_DMSG_ADC12("msp430:adc12: mode repeat, go to wait_trigger\n");
		}
	    }
	  break;

	case ADC12_MODE_REPEAT_SEQ:
	  if ((ENC == 0) && (MCU.adc12.mctl[ ADC12x ].b.eos == 1))
	    {
	      STATE = ADC12_STATE_WAIT_ENABLE;
	      HW_DMSG_ADC12("msp430:adc12: mode repeat sequence, go to wait_enable\n");
	    }
	  else
	    {
	      ADC12x = (ADC12x + 1) % ADC12_CHANNELS;
	      if (MSC && SHP)
		{
		  STATE = ADC12_STATE_SAMPLE;
		  HW_DMSG_ADC12("msp430:adc12: mode repeat sequence, go to sample\n");
		}
	      else
		{
		  STATE = ADC12_STATE_WAIT_TRIGGER;
		  HW_DMSG_ADC12("msp430:adc12: mode repeat sequence, go to wait_trigger\n");
		}
	    }
	  break;
	}
      break;
    }

}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

int16_t msp430_adc12_read16(uint16_t addr)
{
  int16_t ret = 0;

  /*
  static int tinyos_read_this_too_many_times = 0;
  if (tinyos_read_this_too_many_times == 0)
    {
      HW_DMSG_ADC12("msp430:adc12: read16 at [0x%04x] \n",addr);
      tinyos_read_this_too_many_times = 1;
    }
  */

  switch (addr)
    {
    case ADC12CTL0    : /* 16 */
      HW_DMSG_ADC12("msp430:adc12:read16: ADC12CTL0 = 0x%04x\n",MCU.adc12.ctl0.s);
      ret = MCU.adc12.ctl0.s;
      break;

    case ADC12CTL1    : /* 16 */
      HW_DMSG_ADC12("msp430:adc12:read16: ADC12CTL1 = 0x%04x\n",MCU.adc12.ctl1.s);
      ret = MCU.adc12.ctl1.s;
      break;

    case ADC12IFG     : /* 16 */
      HW_DMSG_ADC12("msp430:adc12:read16: ADC12IFG = 0x%04x\n",MCU.adc12.ifg);
      ret = MCU.adc12.ifg;
      break;

    case ADC12IE      : /* 16 */
      HW_DMSG_ADC12("msp430:adc12:read16: ADC12IFG = 0x%04x\n",MCU.adc12.ie);
      ret = MCU.adc12.ie;
      break;

    case  ADC12IV     : /* 16 */
      MCU.adc12.ov  = 0;
      MCU.adc12.tov = 0;
      HW_DMSG_ADC12("msp430:adc12:read16: ADC12IV = 0x%04x\n",MCU.adc12.iv);
      ret = MCU.adc12.iv;
      break;

    case  ADC12MEM0   : /* 16 */
    case  ADC12MEM1   :
    case  ADC12MEM2   :
    case  ADC12MEM3   :
    case  ADC12MEM4   :
    case  ADC12MEM5   :
    case  ADC12MEM6   :
    case  ADC12MEM7   :
    case  ADC12MEM8   :
    case  ADC12MEM9   :
    case  ADC12MEM10  :
    case  ADC12MEM11  :
    case  ADC12MEM12  :
    case  ADC12MEM13  :
    case  ADC12MEM14  :
    case  ADC12MEM15  :
      HW_DMSG_ADC12("msp430:adc12:read16: ADC12MEM%d = 0x%04x\n",addr - ADC12MEM0, 
		    MCU.adc12.mem[(addr - ADC12MEM0) / 2].s);
      MCU.adc12.ifg &= ~(1 << ((addr - ADC12MEM0) / 2));
      ret = MCU.adc12.mem[(addr - ADC12MEM0) / 2].s;
      break;

    default:
      HW_DMSG_ADC12("msp430:adc12:read16: at [0x%04x], unknown address\n",addr);
      break;
    }

  return ret;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

int8_t msp430_adc12_read8(uint16_t addr)
{
  int8_t ret = 0;

  /*
  static int tinyos_read_this_too_many_times = 0;
  if (tinyos_read_this_too_many_times == 0)
    {
      HW_DMSG_ADC12("msp430:adc12: read8 at [0x%04x] \n",addr);
      tinyos_read_this_too_many_times = 1;
    }
  */

  switch (addr) 
    {
    case  ADC12MCTL0  : /*  8 */
    case  ADC12MCTL1  :
    case  ADC12MCTL2  :
    case  ADC12MCTL3  :
    case  ADC12MCTL4  :
    case  ADC12MCTL5  :
    case  ADC12MCTL6  :
    case  ADC12MCTL7  :
    case  ADC12MCTL8  :
    case  ADC12MCTL9  :
    case  ADC12MCTL10 :
    case  ADC12MCTL11 :
    case  ADC12MCTL12 :
    case  ADC12MCTL13 :
    case  ADC12MCTL14 :
    case  ADC12MCTL15 :
      HW_DMSG_ADC12("msp430:adc12:read08: ADC12MEMCTL%d = 0x%02x\n", addr - ADC12MCTL0,
		    MCU.adc12.mctl[addr - ADC12MCTL0].s);
      ret = MCU.adc12.mctl[addr - ADC12MCTL0].s & 0xff;
      break;
    default:
      HW_DMSG_ADC12("msp430:adc12:read08: at [0x%04x], unknown address\n",addr);
      break;
    }
  return ret;
}

