afrab/WSim/arch/msp430/msp430_adc12.c
/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

void msp430_adc12_ctl0details(char* msg, int16_t *val)
{
  struct adc12ctl0_t *ctl0 = (struct adc12ctl0_t*) val;
  HW_DMSG_ADC12("msp430:adc12:%s sht1x      %d\n",msg,ctl0->sht1x);
  HW_DMSG_ADC12("msp430:adc12:%s sht0x      %d\n",msg,ctl0->sht0x);
  HW_DMSG_ADC12("msp430:adc12:%s msc        %d\n",msg,ctl0->msc);
  HW_DMSG_ADC12("msp430:adc12:%s ref2_5v    %d\n",msg,ctl0->ref2_5v);
  HW_DMSG_ADC12("msp430:adc12:%s refon      %d\n",msg,ctl0->refon);
  HW_DMSG_ADC12("msp430:adc12:%s adc12on    %d\n",msg,ctl0->adc12on);
  HW_DMSG_ADC12("msp430:adc12:%s adc12ovie  %d\n",msg,ctl0->adc12ovie);
  HW_DMSG_ADC12("msp430:adc12:%s adc12tovie %d\n",msg,ctl0->adc12tovie);
  HW_DMSG_ADC12("msp430:adc12:%s enc        %d\n",msg,ctl0->enc);
  HW_DMSG_ADC12("msp430:adc12:%s adc12sc    %d\n",msg,ctl0->adc12sc);
}

void msp430_adc12_ctl1details(char* msg, int16_t *val)
{
  struct adc12ctl1_t *ctl1 = (struct adc12ctl1_t*) val;
  HW_DMSG_ADC12("msp430:adc12:%s cstartaddx %d\n",msg,ctl1->cstartaddx);
  HW_DMSG_ADC12("msp430:adc12:%s shsx       %d\n",msg,ctl1->shsx);
  HW_DMSG_ADC12("msp430:adc12:%s shp        %d\n",msg,ctl1->shp);
  HW_DMSG_ADC12("msp430:adc12:%s issh       %d\n",msg,ctl1->issh);
  HW_DMSG_ADC12("msp430:adc12:%s adc12divx  %d\n",msg,ctl1->adc12divx);
  HW_DMSG_ADC12("msp430:adc12:%s adc12sselx %d\n",msg,ctl1->adc12sselx);
  HW_DMSG_ADC12("msp430:adc12:%s conseqx    %d\n",msg,ctl1->conseqx);
  HW_DMSG_ADC12("msp430:adc12:%s adc12busy  %d\n",msg,ctl1->adc12busy);
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

void msp430_adc12_start_enc(void)
{
  char buff[70];
#define FORMAT "msp430:adc12:    * %-50s *\n"

#define ADC12PPP(x...) do {			\
    snprintf(buff,70,x);			\
    HW_DMSG_ADC12(FORMAT,buff);			\
  } while (0)

  ADC12PPP("sht0 = 0x%x /%d",MCU.adc12.ctl0.b.sht0x & 0xf,shtdiv[MCU.adc12.ctl0.b.sht0x]);
  ADC12PPP("sht1 = 0x%x /%d",MCU.adc12.ctl0.b.sht1x & 0xf,shtdiv[MCU.adc12.ctl0.b.sht1x]);

  switch (MCU.adc12.ctl1.b.adc12sselx)
    {
    case 0: /* ADC12OSC */
      ADC12PPP("CLK source = ADC12OSC");
      break;
    case 1: /* ACLK */
      ADC12PPP("CLK source = ACLK");
      break;
    case 2: /* MCLK */
      ADC12PPP("CLK source = MCLK");
      break;
    case 3: /* SMCLK */
      ADC12PPP("CLK source = SMCLK");
      break;
    }
  ADC12PPP("CLK div %d :: /%d",MCU.adc12.ctl1.b.adc12divx,MCU.adc12.ctl1.b.adc12divx+1);
  ADC12PPP("ISSH input signal [%s]",(MCU.adc12.ctl1.b.issh == 0) ? "normal":"inverted");
  ADC12PPP("MSC %d",MCU.adc12.ctl0.b.msc);
  ADC12PPP("SHP %d :: sourced from %s signal",MCU.adc12.ctl1.b.shp,(MCU.adc12.ctl1.b.shp == 0) ? "sample-input":"sampling");
  switch (MCU.adc12.ctl1.b.shsx)
    {
    case 0: /* ADC12SX bit */
      ADC12PPP("SHS source = ADC12SC bit");
      break;
    case 1: /* TimerA.out1 */
      ADC12PPP("SHS source = TimerA.OUT1");
      break;
    case 2: /* TimerB.out0 */
      ADC12PPP("SHS source = TimerB.OUT0");
      break;
    case 3: /* TimerB.out1 */
      ADC12PPP("SHS source = TimerB.OUT1");
      break;
    }
  ADC12PPP("ADC12SC             : %d",MCU.adc12.ctl0.b.adc12sc);
  ADC12PPP("start sequence      : %d",MCU.adc12.ctl1.b.cstartaddx);
  ADC12PPP("conversion sequence : %s",adc12_modes[MCU.adc12.ctl1.b.conseqx]);
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

void msp430_adc12_write16(uint16_t addr, int16_t val)
{
  switch (addr)
    {
    case ADC12CTL0    : /* 16 */
      HW_DMSG_ADC12("msp430:adc12:write16: ADC12CTL0 = 0x%04x\n",val);
      if (val != MCU.adc12.ctl0.s)
	{
	  msp430_adc12_ctl0details("    ctl0 set ",&val);
	}
      if (MCU.adc12.ctl0.b.enc == 0)
	{
	  struct adc12ctl0_t *bval = (struct adc12ctl0_t *) &val;
	  if (bval->enc == 1)
	    {
	      HW_DMSG_ADC12("msp430:adc12:    ** START ENC **\n");
	      /* configuratioin is fixed */
	      msp430_adc12_start_enc();
	      MCU.adc12.current_x = MCU.adc12.ctl1.b.cstartaddx;
	    }
	  MCU.adc12.ctl0.s = val;
	}
      else
	{
	  MCU.adc12.ctl0.s = (MCU.adc12.ctl0.s & 0xfff0) | (val & 0xf);
	}
      break;

    case ADC12CTL1    : /* 16 */
      HW_DMSG_ADC12("msp430:adc12:write16: ADC12CTL1 = 0x%04x\n",val);
      if (val != MCU.adc12.ctl1.s)
	{
	  msp430_adc12_ctl1details("    ctl1 set ",&val);
	}
      if (MCU.adc12.ctl0.b.enc == 0)
	{
	  MCU.adc12.ctl1.s = val;
	}
      else
	{
	  MCU.adc12.ctl1.s = (MCU.adc12.ctl1.s & 0xfff0) | (val & 0xf);
	}
      break;

    case ADC12IFG     : /* 16 */
      if (MCU.adc12.ifg != val)
	{
	  HW_DMSG_ADC12("msp430:adc12:write16: ADC12IFG changed from 0x%04x to 0x%04x\n",MCU.adc12.ifg,val);
	}
      MCU.adc12.ifg = val;
      break;

    case ADC12IE      : /* 16 */
      if (MCU.adc12.ie != val)
	{
	  HW_DMSG_ADC12("msp430:adc12:write16: ADC12IE changed from 0x%04x to 0x%04x\n",MCU.adc12.ie,val);
	}
      MCU.adc12.ie = val;
      break;

    case  ADC12IV     : /* 16 */
      MCU.adc12.ov  = 0;
      MCU.adc12.tov = 0;
      HW_DMSG_ADC12("msp430:adc12:write16: write to ADC12IV, read only register\n");
      break;

    case  ADC12MEM0   : /* 16 */
    case  ADC12MEM1   :
    case  ADC12MEM2   :
    case  ADC12MEM3   :
    case  ADC12MEM4   :
    case  ADC12MEM5   :
    case  ADC12MEM6   :
    case  ADC12MEM7   :
    case  ADC12MEM8   :
    case  ADC12MEM9   :
    case  ADC12MEM10  :
    case  ADC12MEM11  :
    case  ADC12MEM12  :
    case  ADC12MEM13  :
    case  ADC12MEM14  :
    case  ADC12MEM15  :
      HW_DMSG_ADC12("msp430:adc12:write16: ADC12MEM%d = 0x%04x\n", (addr - ADC12MEM0)/2, val & 0xffff);
      MCU.adc12.mem[(addr - ADC12MEM0) / 2].b.value = val & 0x0FFF;
      MCU.adc12.ifg &= ~(1 << ((addr - ADC12MEM0) / 2));
      break;

    default:
      HW_DMSG_ADC12("msp430:adc12:write16: at [0x%04x] = 0x%04x, unknown address\n",addr,val & 0xffff);
      break;
    }
}

