afrab/WSim/arch/msp430/msp430_adc12.c
/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

void msp430_adc12_mctl_details(int n, struct adc12mctlx_t *mctl)
{
  HW_DMSG_ADC12("msp430:adc12:    mctl%d  eos :%d\n",n,mctl->eos);
  HW_DMSG_ADC12("msp430:adc12:    mctl%d  sref:%x\n",n,mctl->sref);
  HW_DMSG_ADC12("msp430:adc12:    mctl%d  inch:%x\n",n,mctl->inch);
}

void msp430_adc12_write8(uint16_t addr, int8_t val)
{
  switch (addr)
    {
    case  ADC12MCTL0  : /*  8 */
    case  ADC12MCTL1  :
    case  ADC12MCTL2  :
    case  ADC12MCTL3  :
    case  ADC12MCTL4  :
    case  ADC12MCTL5  :
    case  ADC12MCTL6  :
    case  ADC12MCTL7  :
    case  ADC12MCTL8  :
    case  ADC12MCTL9  :
    case  ADC12MCTL10 :
    case  ADC12MCTL11 :
    case  ADC12MCTL12 :
    case  ADC12MCTL13 :
    case  ADC12MCTL14 :
    case  ADC12MCTL15 :
      HW_DMSG_ADC12("msp430:adc12:write08: ADC12MCTL%d = 0x%02x\n", addr - ADC12MCTL0, val & 0xff);
      if (MCU.adc12.ctl0.b.enc == 0)
	{
	  MCU.adc12.mctl[addr - ADC12MCTL0].s = val & 0xff;
	  msp430_adc12_mctl_details(addr - ADC12MCTL0, & (MCU.adc12.mctl[addr - ADC12MCTL0].b));
	}
      break;
    default:
      HW_DMSG_ADC12("msp430:adc12:write08: unknown address for [0x%04x] = 0x%02x\n",addr,val & 0xff);
      break;
    }
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */
/*
ADC12IV                                           Interrupt
Contents                                          Priority
                Interrupt Source   Interrupt Flag
  000h   No interrupt pending             -
  002h   ADC12MEMx overflow               -       Highest
  004h   Conversion time overflow         -
  006h   ADC12MEM0  interrupt flag  ADC12IFG0
  008h   ADC12MEM1  interrupt flag  ADC12IFG1
  00Ah   ADC12MEM2  interrupt flag  ADC12IFG2
  00Ch   ADC12MEM3  interrupt flag  ADC12IFG3
  00Eh   ADC12MEM4  interrupt flag  ADC12IFG4
  010h   ADC12MEM5  interrupt flag  ADC12IFG5
  012h   ADC12MEM6  interrupt flag  ADC12IFG6
  014h   ADC12MEM7  interrupt flag  ADC12IFG7
  016h   ADC12MEM8  interrupt flag  ADC12IFG8
  018h   ADC12MEM9  interrupt flag  ADC12IFG9
  01Ah   ADC12MEM10 interrupt flag ADC12IFG10
  01Ch   ADC12MEM11 interrupt flag ADC12IFG11
  01Eh   ADC12MEM12 interrupt flag ADC12IFG12
  020h   ADC12MEM13 interrupt flag ADC12IFG13
  022h   ADC12MEM14 interrupt flag ADC12IFG14
  024h   ADC12MEM15 interrupt flag ADC12IFG15     Lowest
*/

int msp430_adc12_chkifg(void)
{
  int ret = 0;
  if (MCU.adc12.ov)
    {
      MCU.adc12.iv = 2;
      msp430_interrupt_set( INTR_ADC12 );
      return 1;
    }
  if (MCU.adc12.tov)
    {
      MCU.adc12.iv = 4;
      msp430_interrupt_set( INTR_ADC12 );
      return 1;
    }
  if ((MCU.adc12.ifg & MCU.adc12.ie) != 0)
    {
      int i;
      for(i=0; i<ADC12_CHANNELS; i++)
	{
	  if ((MCU.adc12.ifg & MCU.adc12.ie) == (1 << i))
	    {
	      MCU.adc12.iv = 6 + i*2;
	      msp430_interrupt_set( INTR_ADC12 );
	      return 1;
	    }
	}
    }
  return ret;
}

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#endif
